Tekla Open API Reference for Tekla Structures 2025
Localization Constructor
Overload List
Name | Description
Localization()
 Creates a new localization instance.
Localization(String, String)
 Creates a new localization instance.
Top
See Also
Reference
Localization Class
Tekla.Structures.Dialog Namespace